БухЭксп/InformationRegisters/CW_СтатусОбработкиЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусОбработкиЭлектронныхПисем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОбработкиПочтовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ЭлектронныеПисьмаДляОтправки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыОбработкиПочтовыхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыОбработкиПочтовыхСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусОбработкиЭлектронныхПисем/Ext/ManagerModule.bsl
Процедура ЗаписатьСтатусОбработки(ЭлектронноеПисьмо, СтатусОбработки) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.CW_СтатусОбработкиЭлектронныхПисем.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.ЭлектронноеПисьмо = ЭлектронноеПисьмо;
	ЗаписьРегистра.СтатусОбработки = СтатусОбработки;
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьСтатусОбработки(ЭлектронноеПисьмо) Экспорт
	
	Если Не ЗначениеЗаполнено(ЭлектронноеПисьмо) Тогда
		Возврат ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработкиПочтовыхСообщений.Ожидание");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_СтатусОбработкиЭлектронныхПисем.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо,
	               |	CW_СтатусОбработкиЭлектронныхПисем.СтатусОбработки КАК СтатусОбработки
	               |ИЗ
	               |	РегистрСведений.CW_СтатусОбработкиЭлектронныхПисем КАК CW_СтатусОбработкиЭлектронныхПисем
	               |ГДЕ
	               |	CW_СтатусОбработкиЭлектронныхПисем.ЭлектронноеПисьмо = &ЭлектронноеПисьмо";
	
	Запрос.УстановитьПараметр("ЭлектронноеПисьмо", ЭлектронноеПисьмо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатусОбработки;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработкиПочтовыхСообщений.Ожидание");
	
КонецФункции
